bmewburn.vscode-intelephense-client
davidanson.vscode-markdownlint
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
formulahendry.code-runner
geyao.html-snippets
joy-yu.css-snippets
mehedidracula.php-namespace-resolver
ritwickdey.liveserver
st-pham.php-refactor-tool
xabikos.javascriptsnippets
christian-kohler.path-intellisense
pkief.material-icon-theme
redhat.java
mskelton.one-dark-themew