adpyke.vscode-sql-formatter
bmewburn.vscode-intelephense-client
davidanson.vscode-markdownlint
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
formulahendry.code-runner
geyao.html-snippets
joy-yu.css-snippets
mblode.twig-language
mehedidracula.php-namespace-resolver
ritwickdey.liveserver
st-pham.php-refactor-tool
wongjn.php-sniffer
xabikos.javascriptsnippets
hoovercj.vscode-power-mode
christian-kohler.path-intellisense
marp-team.marp-vscode
pkief.material-icon-theme
redhat.java
ms-vscode.cpptools
xdebug.php-debug
mskelton.one-dark-themew